99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
#include "esp32_mquickjs_socket.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "utils/esp32_mquickjs_byte_source.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
#include "utils/esp32_mquickjs_tls_error.h"
#endif

#include <errno.h>
#include <fcntl.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_timer.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
#include "esp_crt_bundle.h"
#include "esp_tls.h"
#endif
#include "lwip/inet.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"

#define SOCKET_HOST_MAX_BYTES 253U
#define SOCKET_POLL_INTERVAL_US 10000U
#define SOCKET_DEFAULT_CONNECT_TIMEOUT_MS 5000
#define SOCKET_MAX_TIMEOUT_MS 60000
#define SOCKET_DEFAULT_LISTEN_BACKLOG 4

typedef enum {
    SOCKET_PROTOCOL_NONE = 0,
    SOCKET_PROTOCOL_TCP,
    SOCKET_PROTOCOL_UDP,
} socket_protocol_t;

typedef struct {
    int id;
    int fd;
    socket_protocol_t protocol;
    bool connected;
    bool listening;
    bool peer_closed;
    bool busy;
    bool secure;
    int local_port;
    int remote_port;
    char local_ip[INET6_ADDRSTRLEN];
    char remote_host[SOCKET_HOST_MAX_BYTES + 1U];
    uint32_t sent_bytes;
    uint32_t received_bytes;
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    esp_tls_t *tls;
#endif
} socket_entry_t;

typedef struct {
    bool initialized;
    int next_id;
    socket_entry_t entries[CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES];
} socket_state_t;

static socket_state_t s_socket;

static bool socket_register_future_drivers(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime);

static const char *socket_protocol_name(socket_protocol_t protocol)
{
    return protocol == SOCKET_PROTOCOL_TCP ? "tcp" :
           protocol == SOCKET_PROTOCOL_UDP ? "udp" : "unknown";
}

static void socket_reset_entry(socket_entry_t *entry)
{
    if (entry == NULL) {
        return;
    }
    memset(entry, 0, sizeof(*entry));
    entry->fd = -1;
}

static socket_entry_t *socket_find_entry(int id)
{
    size_t i;

    if (id <= 0) {
        return NULL;
    }
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES; ++i) {
        if (s_socket.entries[i].id == id) {
            return &s_socket.entries[i];
        }
    }
    return NULL;
}

static socket_entry_t *socket_allocate_entry(void)
{
    size_t i;

    for (i = 0; i < CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES; ++i) {
        socket_entry_t *entry = &s_socket.entries[i];

        if (entry->id != 0) {
            continue;
        }
        socket_reset_entry(entry);
        s_socket.next_id++;
        if (s_socket.next_id <= 0) {
            s_socket.next_id = 1;
        }
        entry->id = s_socket.next_id;
        return entry;
    }
    return NULL;
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
static void socket_close_tls_connection(socket_entry_t *entry)
{
    if (entry == NULL) {
        return;
    }
    if (entry->tls != NULL) {
        (void)esp_tls_conn_destroy(entry->tls);
        entry->tls = NULL;
    }
    entry->fd = -1;
    entry->connected = false;
}
#endif

static void socket_close_entry(socket_entry_t *entry)
{
    if (entry == NULL || entry->id == 0) {
        return;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (entry->tls != NULL) {
        socket_close_tls_connection(entry);
    } else
#endif
    if (entry->fd >= 0) {
        shutdown(entry->fd, SHUT_RDWR);
        close(entry->fd);
    }
    socket_reset_entry(entry);
}

static bool socket_to_int(JSContext *ctx,
                          JSValue value,
                          int min_value,
                          int max_value,
                          int *out_value)
{
    int raw_value;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 ||
        raw_value < min_value || raw_value > max_value) {
        return false;
    }
    *out_value = raw_value;
    return true;
}

static bool socket_optional_int(JSContext *ctx,
                                int argc,
                                JSValue *argv,
                                int index,
                                int default_value,
                                int min_value,
                                int max_value,
                                int *out_value)
{
    if (index >= argc || JS_IsUndefined(argv[index])) {
        *out_value = default_value;
        return true;
    }
    return socket_to_int(ctx, argv[index], min_value, max_value, out_value);
}

static bool socket_open_options(JSContext *ctx,
                                int argc,
                                JSValue *argv,
                                int *out_local_port,
                                bool *out_secure)
{
    JSGCRef option_ref;
    JSValue *option;
    bool valid = true;

    *out_local_port = 0;
    *out_secure = false;
    if (argc < 2 || JS_IsUndefined(argv[1])) {
        return true;
    }
    if (JS_GetClassID(ctx, argv[1]) < 0 || JS_IsArray(ctx, argv[1])) {
        return false;
    }

    option = JS_PushGCRef(ctx, &option_ref);
    *option = JS_GetPropertyStr(ctx, argv[1], "localPort");
    if (JS_IsException(*option) ||
        (!JS_IsUndefined(*option) &&
         !socket_to_int(ctx, *option, 0, 65535, out_local_port))) {
        valid = false;
    }
    if (valid) {
        *option = JS_GetPropertyStr(ctx, argv[1], "tls");
        if (JS_IsException(*option) ||
            (!JS_IsUndefined(*option) && !JS_IsBool(*option))) {
            valid = false;
        } else if (!JS_IsUndefined(*option)) {
            *out_secure = *option == JS_TRUE;
        }
    }
    JS_PopGCRef(ctx, &option_ref);
    return valid;
}

static socket_entry_t *socket_require_entry(JSContext *ctx,
                                            JSValue value,
                                            socket_protocol_t protocol)
{
    socket_entry_t *entry;
    int id;

    if (!socket_to_int(ctx, value, 1, INT32_MAX, &id)) {
        JS_ThrowTypeError(ctx, "invalid socket_id");
        return NULL;
    }
    entry = socket_find_entry(id);
    if (entry == NULL) {
        JS_ThrowRangeError(ctx, "unknown socket_id");
        return NULL;
    }
    if (protocol != SOCKET_PROTOCOL_NONE && entry->protocol != protocol) {
        JS_ThrowTypeError(ctx, "socket protocol does not match operation");
        return NULL;
    }
    return entry;
}

static bool socket_set_nonblocking(int fd)
{
    int flags = fcntl(fd, F_GETFL, 0);

    return flags >= 0 && fcntl(fd, F_SETFL, flags | O_NONBLOCK) == 0;
}

