99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
static bool socket_format_address(const struct sockaddr_storage *address,
                                  char *host,
                                  size_t host_size,
                                  int *port)
{
    const void *raw_address;

    if (address->ss_family == AF_INET) {
        const struct sockaddr_in *ipv4 = (const struct sockaddr_in *)address;

        raw_address = &ipv4->sin_addr;
        *port = ntohs(ipv4->sin_port);
    } else if (address->ss_family == AF_INET6) {
        const struct sockaddr_in6 *ipv6 = (const struct sockaddr_in6 *)address;

        raw_address = &ipv6->sin6_addr;
        *port = ntohs(ipv6->sin6_port);
    } else {
        return false;
    }
    return inet_ntop(address->ss_family, raw_address, host, host_size) != NULL;
}

static void socket_refresh_local_address(socket_entry_t *entry)
{
    struct sockaddr_storage address;
    socklen_t address_len = sizeof(address);

    if (getsockname(entry->fd, (struct sockaddr *)&address, &address_len) != 0 ||
        !socket_format_address(&address,
                               entry->local_ip,
                               sizeof(entry->local_ip),
                               &entry->local_port)) {
        snprintf(entry->local_ip, sizeof(entry->local_ip), "0.0.0.0");
    }
}

static int socket_poll_fd(int fd, bool writable)
{
    fd_set read_fds;
    fd_set write_fds;
    struct timeval timeout = {0};

    FD_ZERO(&read_fds);
    FD_ZERO(&write_fds);
    if (writable) {
        FD_SET(fd, &write_fds);
    } else {
        FD_SET(fd, &read_fds);
    }
    return select(fd + 1,
                  writable ? NULL : &read_fds,
                  writable ? &write_fds : NULL,
                  NULL,
                  &timeout);
}

static bool socket_resolve(const char *host,
                           int port,
                           int socktype,
                           struct addrinfo **out_addresses)
{
    struct addrinfo hints = {0};
    char service[6];

    snprintf(service, sizeof(service), "%d", port);
    hints.ai_family = AF_UNSPEC;
    hints.ai_socktype = socktype;
    return getaddrinfo(host, service, &hints, out_addresses) == 0;
}

static bool socket_get_host(JSContext *ctx,
                            JSValue value,
                            char *host,
                            size_t host_size)
{
    JSCStringBuf host_buf;
    const char *raw_host;
    size_t host_len = 0;

    if (!JS_IsString(ctx, value)) {
        return false;
    }
    raw_host = JS_ToCStringLen(ctx, &host_len, value, &host_buf);
    if (raw_host == NULL || host_len == 0 || host_len >= host_size) {
        return false;
    }
    memcpy(host, raw_host, host_len);
    host[host_len] = '\0';
    return true;
}

bool esp32_mquickjs_init_socket_runtime(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    size_t i;

    if (s_socket.initialized) {
        return true;
    }
    memset(&s_socket, 0, sizeof(s_socket));
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES; ++i) {
        s_socket.entries[i].fd = -1;
    }
    s_socket.initialized = true;
    if (!socket_register_future_drivers(ctx, runtime)) {
        memset(&s_socket, 0, sizeof(s_socket));
        return false;
    }
    return true;
}

void esp32_mquickjs_deinit_socket_runtime(JSContext *ctx)
{
    size_t i;

    (void)ctx;
    if (!s_socket.initialized) {
        return;
    }
    for (i = 0; i < CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES; ++i) {
        socket_close_entry(&s_socket.entries[i]);
    }
    memset(&s_socket, 0, sizeof(s_socket));
}

JSValue js_socket_open(JSContext *ctx,
                       JSValue *this_val,
                       int argc,
                       JSValue *argv)
{
    JSCStringBuf protocol_buf;
    const char *protocol_name;
    socket_protocol_t protocol;
    socket_entry_t *entry;
    struct sockaddr_in local_address = {0};
    int local_port;
    int fd;
    bool secure;

    (void)this_val;
    if (argc < 1 || !JS_IsString(ctx, argv[0]) ||
        !socket_open_options(ctx, argc, argv, &local_port, &secure)) {
        return JS_ThrowTypeError(ctx,
                                 "socket.open(protocol, options) expects tcp or udp and an options object");
    }
    protocol_name = JS_ToCString(ctx, argv[0], &protocol_buf);
    if (protocol_name == NULL) {
        return JS_EXCEPTION;
    }
    if (strcmp(protocol_name, "tcp") == 0) {
        protocol = SOCKET_PROTOCOL_TCP;
    } else if (strcmp(protocol_name, "udp") == 0) {
        protocol = SOCKET_PROTOCOL_UDP;
    } else {
        return JS_ThrowRangeError(ctx, "socket protocol must be tcp or udp");
    }
#if !CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (secure) {
        return JS_ThrowTypeError(ctx,
                                 "TLS sockets require the TLS firmware capability");
    }
#else
    if (secure && protocol != SOCKET_PROTOCOL_TCP) {
        return JS_ThrowTypeError(ctx, "TLS is only supported for TCP client sockets");
    }
    if (secure && local_port != 0) {
        return JS_ThrowRangeError(ctx, "TLS client sockets do not support a fixed localPort");
    }
#if !defined(CONFIG_MBEDTLS_CERTIFICATE_BUNDLE) || !CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    if (secure) {
        return JS_ThrowInternalError(ctx,
                                     "TLS socket support requires the certificate bundle");
    }
#endif
#endif
    entry = socket_allocate_entry();
    if (entry == NULL) {
        return JS_ThrowInternalError(ctx, "socket handle limit reached");
    }
    if (secure) {
        entry->protocol = SOCKET_PROTOCOL_TCP;
        entry->secure = true;
        snprintf(entry->local_ip, sizeof(entry->local_ip), "0.0.0.0");
        return JS_NewInt32(ctx, entry->id);
    }
    fd = socket(AF_INET,
                protocol == SOCKET_PROTOCOL_TCP ? SOCK_STREAM : SOCK_DGRAM,
                0);
    if (fd < 0 || !socket_set_nonblocking(fd)) {
        if (fd >= 0) {
            close(fd);
        }
        socket_reset_entry(entry);
        return JS_ThrowInternalError(ctx, "socket.open() failed: errno=%d", errno);
    }
    local_address.sin_family = AF_INET;
    local_address.sin_addr.s_addr = htonl(INADDR_ANY);
    local_address.sin_port = htons((uint16_t)local_port);
    if (bind(fd, (struct sockaddr *)&local_address, sizeof(local_address)) != 0) {
        close(fd);
        socket_reset_entry(entry);
        return JS_ThrowInternalError(ctx, "socket.open() bind failed: errno=%d", errno);
    }
    entry->fd = fd;
    entry->protocol = protocol;
    socket_refresh_local_address(entry);
    return JS_NewInt32(ctx, entry->id);
}

JSValue js_socket_close(JSContext *ctx,
                        JSValue *this_val,
                        int argc,
                        JSValue *argv)
{
    socket_entry_t *entry;
    int id;

    (void)this_val;
    if (argc < 1 || !socket_to_int(ctx, argv[0], 1, INT32_MAX, &id)) {
        return JS_ThrowTypeError(ctx, "socket.close(socket_id) expects a socket id");
    }
    entry = socket_find_entry(id);
    if (entry == NULL) {
        return JS_NewBool(false);
    }
    if (entry->busy) {
        return JS_ThrowInternalError(ctx,
                                     "socket.close() refused while an operation is pending");
    }
    socket_close_entry(entry);
    return JS_NewBool(true);
}

JSValue js_socket_status(JSContext *ctx,
                         JSValue *this_val,
                         int argc,
                         JSValue *argv)
{
    socket_entry_t *entry;
    JSGCRef status_ref;
    JSValue *status;

    (void)this_val;
    if (argc < 1 || (entry = socket_require_entry(ctx,
                                                  argv[0],
                                                  SOCKET_PROTOCOL_NONE)) == NULL) {
        return JS_EXCEPTION;
    }
    socket_refresh_local_address(entry);
    status = JS_PushGCRef(ctx, &status_ref);
    *status = JS_NewObject(ctx);
    if (JS_IsException(*status) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "id", JS_NewInt32(ctx, entry->id)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "protocol",
                                         JS_NewString(ctx, socket_protocol_name(entry->protocol))) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "secure",
                                         JS_NewBool(entry->secure)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "connected",
                                         JS_NewBool(entry->connected)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "listening",
                                         JS_NewBool(entry->listening)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "peerClosed",
                                         JS_NewBool(entry->peer_closed)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "localIp",
                                         JS_NewString(ctx, entry->local_ip)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "localPort",
                                         JS_NewInt32(ctx, entry->local_port)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "remoteHost",
                                         JS_NewString(ctx, entry->remote_host)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "remotePort",
                                         JS_NewInt32(ctx, entry->remote_port)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "sentBytes",
                                         JS_NewInt32(ctx, (int32_t)entry->sent_bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                         status,
                                         "receivedBytes",
                                         JS_NewInt32(ctx, (int32_t)entry->received_bytes))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &status_ref);
}

JSValue js_socket_get_max_transfer_bytes(JSContext *ctx,
                                         JSValue *this_val,
                                         int argc,
                                         JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, CONFIG_ESP32_MQUICKJS_SOCKET_MAX_MESSAGE_BYTES);
}

static JSValue socket_future_call_and_wait(JSContext *ctx,
                                           const char *family_name,
                                           const char *method_name,
                                           int argc,
                                           JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef socket_ref;
    JSGCRef family_ref;
    JSGCRef method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *socket = JS_PushGCRef(ctx, &socket_ref);
    JSValue *family = JS_PushGCRef(ctx, &family_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *global = JS_GetGlobalObject(ctx);
    *socket = JS_IsException(*global)
        ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *global, "socket");
    *family = JS_IsException(*socket)
        ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *socket, family_name);
    *method = JS_IsException(*family)
        ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *family, method_name);
    if (JS_IsException(*global) || JS_IsException(*socket) ||
        JS_IsException(*family) || JS_IsException(*method)) {
        result = JS_EXCEPTION;
    } else {
        result = esp32_mquickjs_future_call_and_wait(ctx,
                                                     esp32_mquickjs_get_active_runtime(),
                                                     *method,
                                                     *family,
                                                     argc,
                                                     argv);
    }
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &family_ref);
    JS_PopGCRef(ctx, &socket_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

