99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
typedef enum {
    SOCKET_FUTURE_TCP_CONNECT,
    SOCKET_FUTURE_TCP_ACCEPT,
    SOCKET_FUTURE_TCP_SEND,
    SOCKET_FUTURE_TCP_RECV,
    SOCKET_FUTURE_UDP_SENDTO,
    SOCKET_FUTURE_UDP_RECVFROM,
} socket_future_kind_t;

struct esp32_mquickjs_future_driver_state {
    socket_future_kind_t kind;
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp_timer_handle_t poll_timer;
    int entry_id;
    int fd;
    int port;
    int timeout_ms;
    int error_code;
    int client_fd;
    int remote_port;
    uint64_t deadline_us;
    size_t length;
    size_t offset;
    ssize_t received;
    uint8_t *data;
    const uint8_t *send_data;
    JSGCRef send_owner_ref;
    esp32_mquickjs_byte_span_source_t send_source;
    esp32_mquickjs_byte_span_t send_span;
    size_t send_span_offset;
    size_t source_produced;
    struct sockaddr_storage address;
    socklen_t address_len;
    char host[SOCKET_HOST_MAX_BYTES + 1U];
    char error_text[96];
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    esp_tls_cfg_t tls_config;
    esp32_mquickjs_tls_error_t tls_error;
#endif
    bool started;
    bool issued;
    bool empty_result;
    bool completed;
    bool cancelled;
    bool send_owner_rooted;
    bool send_source_open;
    bool send_is_span_source;
    bool source_has_known_length;
};

static socket_entry_t *socket_future_entry(
    const esp32_mquickjs_future_driver_state_t *state)
{
    socket_entry_t *entry = state != NULL ? socket_find_entry(state->entry_id) : NULL;

    return entry != NULL && entry->fd == state->fd ? entry : NULL;
}

static void socket_future_fail(esp32_mquickjs_future_driver_state_t *state,
                               int error_code,
                               const char *message)
{
    if (state == NULL || state->completed) {
        return;
    }
    state->error_code = error_code != 0 ? error_code : EIO;
    if (message != NULL) {
        snprintf(state->error_text, sizeof(state->error_text), "%s", message);
    }
    state->completed = true;
}

static bool socket_future_copy_source(JSContext *ctx,
                                      JSValue value,
                                      const char *api_name,
                                      esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue source_error = JS_UNDEFINED;

    if (!esp32_mquickjs_get_byte_source(ctx,
                                       value,
                                       api_name,
                                       &source,
                                       &owned,
                                       &source_error)) {
        if (!JS_IsException(source_error)) {
            (void)JS_Throw(ctx, source_error);
        }
        return false;
    }
    if (source.length > CONFIG_ESP32_MQUICKJS_SOCKET_MAX_MESSAGE_BYTES) {
        esp32_mquickjs_release_byte_source(owned);
        JS_ThrowRangeError(ctx, "%s data exceeds socket limit", api_name);
        return false;
    }
    if (source.length > 0) {
        state->data = heap_caps_malloc(source.length, MALLOC_CAP_8BIT);
        if (state->data == NULL) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        memcpy(state->data, source.data, source.length);
    }
    state->length = source.length;
    esp32_mquickjs_release_byte_source(owned);
    return true;
}

static void socket_future_release_send_source(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    esp32_mquickjs_byte_span_clear(&state->send_span);
    if (state->send_source_open) {
        esp32_mquickjs_byte_span_source_close(state->ctx,
                                              &state->send_source);
        state->send_source_open = false;
    }
    if (state->send_owner_rooted) {
        JS_DeleteGCRef(state->ctx, &state->send_owner_ref);
        state->send_owner_rooted = false;
    }
}

static bool socket_future_prepare_tcp_source(
    JSContext *ctx,
    JSValue value,
    const char *api_name,
    esp32_mquickjs_future_driver_state_t *state)
{
    int class_id = JS_GetClassID(ctx, value);

    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        JSValue source_error = JS_UNDEFINED;
        size_t known_length = 0;

        state->source_has_known_length =
            esp32_mquickjs_byte_span_source_known_length(
                ctx, value, &known_length);
        if (state->source_has_known_length &&
            known_length > CONFIG_ESP32_MQUICKJS_SOCKET_MAX_SOURCE_BYTES) {
            JS_ThrowRangeError(ctx, "%s source exceeds socket stream limit",
                               api_name);
            return false;
        }
        if (!esp32_mquickjs_open_byte_span_source(
                ctx, value, api_name, &state->send_source, &source_error)) {
            if (!JS_IsUndefined(source_error) &&
                !JS_IsException(source_error)) {
                (void)JS_Throw(ctx, source_error);
            }
            return false;
        }
        state->send_source_open = true;
        state->send_is_span_source = true;
        state->length = known_length;
        *JS_AddGCRef(ctx, &state->send_owner_ref) = value;
        state->send_owner_rooted = true;
        return true;
    }

    {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue source_error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_byte_source(ctx, value, api_name, &source,
                                            &owned, &source_error)) {
            if (!JS_IsUndefined(source_error) &&
                !JS_IsException(source_error)) {
                (void)JS_Throw(ctx, source_error);
            }
            return false;
        }
        if (source.length > CONFIG_ESP32_MQUICKJS_SOCKET_MAX_MESSAGE_BYTES) {
            esp32_mquickjs_release_byte_source(owned);
            JS_ThrowRangeError(ctx, "%s data exceeds socket limit", api_name);
            return false;
        }
        state->data = owned;
        state->send_data = source.data;
        state->length = source.length;
        if (owned == NULL && source.length > 0) {
            *JS_AddGCRef(ctx, &state->send_owner_ref) = value;
            state->send_owner_rooted = true;
        }
        return true;
    }
}

static esp32_mquickjs_future_driver_state_t *socket_future_allocate(
    JSContext *ctx,
    JSValue socket_id,
    socket_protocol_t protocol,
    socket_future_kind_t kind)
{
    esp32_mquickjs_future_driver_state_t *state;
    socket_entry_t *entry = socket_require_entry(ctx, socket_id, protocol);

