99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
    if (entry == NULL) {
        return NULL;
    }
    if (entry->busy) {
        JS_ThrowInternalError(ctx, "socket already has an operation in progress");
        return NULL;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    state->kind = kind;
    state->ctx = ctx;
    state->entry_id = entry->id;
    state->fd = entry->fd;
    state->client_fd = -1;
    state->received = -1;
    esp32_mquickjs_byte_span_clear(&state->send_span);
    return state;
}

static bool socket_tcp_connect_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    socket_entry_t *entry;

    (void)this_ref;
    if (out_state == NULL || argc < 3 || argc > 4) {
        JS_ThrowTypeError(ctx,
                          "socket.tcp.connect(socketId, remoteHost, remotePort, timeoutMs?) expected");
        return false;
    }
    state = socket_future_allocate(ctx, argv[0].val, SOCKET_PROTOCOL_TCP,
                                   SOCKET_FUTURE_TCP_CONNECT);
    if (state == NULL) {
        return false;
    }
    entry = socket_future_entry(state);
    if (entry == NULL || entry->connected || entry->listening ||
        !socket_get_host(ctx, argv[1].val, state->host, sizeof(state->host)) ||
        !socket_to_int(ctx, argv[2].val, 1, 65535, &state->port) ||
        (argc >= 4 && !JS_IsUndefined(argv[3].val) &&
         !socket_to_int(ctx, argv[3].val, 0, SOCKET_MAX_TIMEOUT_MS,
                        &state->timeout_ms))) {
        heap_caps_free(state);
        if (entry != NULL && (entry->connected || entry->listening)) {
            JS_ThrowInternalError(ctx, "TCP socket is already active");
        } else {
            JS_ThrowTypeError(ctx,
                              "socket.tcp.connect(socketId, remoteHost, remotePort, timeoutMs?) expected");
        }
        return false;
    }
    if (argc < 4 || JS_IsUndefined(argv[3].val)) {
        state->timeout_ms = SOCKET_DEFAULT_CONNECT_TIMEOUT_MS;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (entry->secure) {
        state->tls_config.non_block = true;
        state->tls_config.timeout_ms = state->timeout_ms;
#if defined(CONFIG_MBEDTLS_CERTIFICATE_BUNDLE) && CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
        state->tls_config.crt_bundle_attach =
            esp32_mquickjs_tls_crt_bundle_attach;
#endif
    }
#endif
    *out_state = state;
    return true;
}

static bool socket_tcp_accept_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    socket_entry_t *entry;

    (void)this_ref;
    if (out_state == NULL || argc < 1 || argc > 2) {
        JS_ThrowTypeError(ctx, "socket.tcp.accept(socketId, timeoutMs?) expected");
        return false;
    }
    state = socket_future_allocate(ctx, argv[0].val, SOCKET_PROTOCOL_TCP,
                                   SOCKET_FUTURE_TCP_ACCEPT);
    if (state == NULL) {
        return false;
    }
    entry = socket_future_entry(state);
    if (entry == NULL || !entry->listening ||
        (argc >= 2 && !JS_IsUndefined(argv[1].val) &&
         !socket_to_int(ctx, argv[1].val, 0, SOCKET_MAX_TIMEOUT_MS,
                        &state->timeout_ms))) {
        heap_caps_free(state);
        if (entry != NULL && !entry->listening) {
            JS_ThrowInternalError(ctx, "TCP socket is not listening");
        } else {
            JS_ThrowRangeError(ctx, "invalid socket.tcp.accept() timeout");
        }
        return false;
    }
    *out_state = state;
    return true;
}

static bool socket_tcp_send_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    socket_entry_t *entry;

    (void)this_ref;
    if (out_state == NULL || argc < 2 || argc > 3) {
        JS_ThrowTypeError(ctx,
                          "socket.tcp.send(socketId, data, timeoutMs?) expects ByteView or ByteSpanSource data");
        return false;
    }
    state = socket_future_allocate(ctx, argv[0].val, SOCKET_PROTOCOL_TCP,
                                   SOCKET_FUTURE_TCP_SEND);
    if (state == NULL) {
        return false;
    }
    entry = socket_future_entry(state);
    if (entry == NULL || !entry->connected ||
        (argc >= 3 && !JS_IsUndefined(argv[2].val) &&
         !socket_to_int(ctx, argv[2].val, 0, SOCKET_MAX_TIMEOUT_MS,
                        &state->timeout_ms)) ||
        !socket_future_prepare_tcp_source(
            ctx, argv[1].val,
            "socket.tcp.send(socketId, data, timeoutMs?)", state)) {
        socket_future_release_send_source(state);
        heap_caps_free(state->data);
        heap_caps_free(state);
        if (entry != NULL && !entry->connected) {
            JS_ThrowInternalError(ctx, "TCP socket is not connected");
        } else if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx,
                              "socket.tcp.send(socketId, data, timeoutMs?) expects ByteView or ByteSpanSource data");
        }
        return false;
    }
    *out_state = state;
    return true;
}

static bool socket_receive_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    socket_protocol_t protocol,
    socket_future_kind_t kind,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    int max_bytes;

    (void)this_ref;
    if (out_state == NULL || argc < 1 || argc > 3) {
        JS_ThrowRangeError(ctx, "invalid socket receive option");
        return false;
    }
    state = socket_future_allocate(ctx, argv[0].val, protocol, kind);
    if (state == NULL) {
        return false;
    }
    max_bytes = CONFIG_ESP32_MQUICKJS_SOCKET_MAX_MESSAGE_BYTES;
    if ((argc >= 2 && !JS_IsUndefined(argv[1].val) &&
         !socket_to_int(ctx, argv[1].val, 1,
                        CONFIG_ESP32_MQUICKJS_SOCKET_MAX_MESSAGE_BYTES,
                        &max_bytes)) ||
        (argc >= 3 && !JS_IsUndefined(argv[2].val) &&
         !socket_to_int(ctx, argv[2].val, 0, SOCKET_MAX_TIMEOUT_MS,
                        &state->timeout_ms))) {
        heap_caps_free(state);
        JS_ThrowRangeError(ctx, "invalid socket receive option");
        return false;
    }
    state->length = (size_t)max_bytes;
    state->data = heap_caps_malloc(state->length, MALLOC_CAP_8BIT);
    if (state->data == NULL) {
        heap_caps_free(state);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    *out_state = state;
    return true;
}

static bool socket_tcp_recv_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return socket_receive_future_prepare(ctx, this_ref, argc, argv,
                                         SOCKET_PROTOCOL_TCP,
                                         SOCKET_FUTURE_TCP_RECV,
                                         out_state);
}

static bool socket_udp_sendto_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

    (void)this_ref;
    if (out_state == NULL || argc != 4) {
        JS_ThrowTypeError(ctx,
                          "socket.udp.sendto(socketId, remoteHost, remotePort, data) expected");
        return false;
    }
    state = socket_future_allocate(ctx, argv[0].val, SOCKET_PROTOCOL_UDP,
                                   SOCKET_FUTURE_UDP_SENDTO);
    if (state == NULL) {
        return false;
    }
    if (!socket_get_host(ctx, argv[1].val, state->host, sizeof(state->host)) ||
        !socket_to_int(ctx, argv[2].val, 1, 65535, &state->port) ||
        !socket_future_copy_source(ctx, argv[3].val,
                                   "socket.udp.sendto(socketId, remoteHost, remotePort, data)",
                                   state)) {
        heap_caps_free(state->data);
        heap_caps_free(state);
        JS_ThrowTypeError(ctx,
                          "socket.udp.sendto(socketId, remoteHost, remotePort, data) expected");
        return false;
    }
    *out_state = state;
    return true;
}

static bool socket_udp_recvfrom_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return socket_receive_future_prepare(ctx, this_ref, argc, argv,
                                         SOCKET_PROTOCOL_UDP,
                                         SOCKET_FUTURE_UDP_RECVFROM,
                                         out_state);
}

static void socket_future_poll_timer(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state != NULL && !state->completed) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
}

