99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
static void socket_future_stop_timer(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->poll_timer == NULL) {
        return;
    }
    (void)esp_timer_stop(state->poll_timer);
    (void)esp_timer_delete(state->poll_timer);
    state->poll_timer = NULL;
}

static bool socket_future_resolve_address(esp32_mquickjs_future_driver_state_t *state,
                                          int socktype)
{
    struct addrinfo *addresses = NULL;
    struct addrinfo *address;
    bool found = false;

    if (!socket_resolve(state->host, state->port, socktype, &addresses)) {
        socket_future_fail(state, EHOSTUNREACH, "could not resolve remoteHost");
        return false;
    }
    for (address = addresses; address != NULL; address = address->ai_next) {
        if (address->ai_family != AF_INET ||
            address->ai_addrlen > sizeof(state->address)) {
            continue;
        }
        memcpy(&state->address, address->ai_addr, address->ai_addrlen);
        state->address_len = (socklen_t)address->ai_addrlen;
        found = true;
        break;
    }
    freeaddrinfo(addresses);
    if (!found) {
        socket_future_fail(state, EAFNOSUPPORT, "remoteHost has no IPv4 address");
    }
    return found;
}

static void socket_future_step_connect(esp32_mquickjs_future_driver_state_t *state,
                                       socket_entry_t *entry)
{
    int ready;
    int connect_error = 0;
    socklen_t error_len = sizeof(connect_error);

#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (entry->secure) {
        int result;
        int fd = -1;

        if (entry->tls == NULL) {
            entry->tls = esp_tls_init();
            if (entry->tls == NULL) {
                esp32_mquickjs_tls_error_set(
                    &state->tls_error, ESP_ERR_NO_MEM, ESP_OK, 0, 0);
                socket_future_fail(state, ENOMEM, "could not allocate TLS context");
                return;
            }
        }
        state->issued = true;
        result = esp_tls_conn_new_async(state->host,
                                        (int)strlen(state->host),
                                        state->port,
                                        &state->tls_config,
                                        entry->tls);
        if (result < 0) {
            esp32_mquickjs_tls_error_capture(
                &state->tls_error, entry->tls, ESP_FAIL);
            socket_future_fail(state, EIO, "TLS handshake failed");
        } else if (result > 0) {
            esp32_mquickjs_tls_error_merge_verify_flags(&state->tls_error);
            if (esp_tls_get_conn_sockfd(entry->tls, &fd) != ESP_OK || fd < 0) {
                socket_future_fail(state, EIO, "TLS socket descriptor unavailable");
                return;
            }
            entry->fd = fd;
            state->fd = fd;
            state->completed = true;
        }
        return;
    }
#endif

    if (!state->issued) {
        int result;

        state->issued = true;
        if (!socket_future_resolve_address(state, SOCK_STREAM)) {
            return;
        }
        result = connect(entry->fd,
                         (struct sockaddr *)&state->address,
                         state->address_len);
        if (result == 0 || (result < 0 && errno == EISCONN)) {
            state->completed = true;
            return;
        }
        if (errno != EINPROGRESS && errno != EALREADY && errno != EINTR) {
            socket_future_fail(state, errno, NULL);
            return;
        }
    }
    ready = socket_poll_fd(entry->fd, true);
    if (ready < 0 && errno != EINTR) {
        socket_future_fail(state, errno, NULL);
    } else if (ready > 0 &&
               (getsockopt(entry->fd, SOL_SOCKET, SO_ERROR,
                           &connect_error, &error_len) != 0 || connect_error != 0)) {
        socket_future_fail(state,
                           connect_error != 0 ? connect_error : errno,
                           NULL);
    } else if (ready > 0) {
        state->completed = true;
    }
}

static void socket_future_step_accept(esp32_mquickjs_future_driver_state_t *state,
                                      socket_entry_t *entry)
{
    int ready = socket_poll_fd(entry->fd, false);

    if (ready < 0 && errno != EINTR) {
        socket_future_fail(state, errno, NULL);
        return;
    }
    if (ready <= 0) {
        return;
    }
    state->address_len = sizeof(state->address);
    state->client_fd = accept(entry->fd,
                              (struct sockaddr *)&state->address,
                              &state->address_len);
    if (state->client_fd < 0) {
        if (errno == EAGAIN || errno == EWOULDBLOCK || errno == EINTR) {
            return;
        }
        socket_future_fail(state, errno, NULL);
        return;
    }
    state->completed = true;
}

static bool socket_future_load_send_span(
    esp32_mquickjs_future_driver_state_t *state)
{
    unsigned empty_spans = 0;

    while (state->send_span_offset >= state->send_span.length) {
        esp32_mquickjs_byte_span_clear(&state->send_span);
        state->send_span_offset = 0;
        if (!esp32_mquickjs_byte_span_source_next(
                state->ctx, &state->send_source, &state->send_span)) {
            if (JS_HasException(state->ctx)) {
                (void)JS_GetException(state->ctx);
                socket_future_fail(state, EIO,
                                   "ByteSpanSource iteration failed");
            } else if (state->source_has_known_length &&
                       state->offset != state->length) {
                socket_future_fail(state, EIO,
                                   "ByteSpanSource length changed during send");
            } else {
                state->completed = true;
            }
            return false;
        }
        if (state->send_span.length == 0) {
            if (++empty_spans > 16) {
                socket_future_fail(state, EIO,
                                   "ByteSpanSource yielded too many empty spans");
                return false;
            }
            continue;
        }
        if (state->send_span.data == NULL ||
            state->send_span.length >
                CONFIG_ESP32_MQUICKJS_SOCKET_MAX_SOURCE_BYTES -
                    state->source_produced) {
            socket_future_fail(state, EFBIG,
                               "ByteSpanSource exceeds socket stream limit");
            return false;
        }
        if (state->source_has_known_length &&
            state->send_span.length > state->length - state->source_produced) {
            socket_future_fail(state, EIO,
                               "ByteSpanSource length changed during send");
            return false;
        }
        state->source_produced += state->send_span.length;
    }
    return true;
}

static void socket_future_step_send(esp32_mquickjs_future_driver_state_t *state,
                                    socket_entry_t *entry)
{
    const uint8_t *data;
    size_t remaining;
    ssize_t sent;
    int ready;

    if (state->send_is_span_source) {
        if (!socket_future_load_send_span(state)) {
            return;
        }
        data = state->send_span.data + state->send_span_offset;
        remaining = state->send_span.length - state->send_span_offset;
    } else {
        if (state->offset >= state->length) {
            state->completed = true;
            return;
        }
        data = state->send_data + state->offset;
        remaining = state->length - state->offset;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (entry->secure) {
        if (entry->tls == NULL) {
            socket_future_fail(state, EBADF, "TLS connection is unavailable");
            return;
        }
        sent = esp_tls_conn_write(entry->tls,
                                  data,
                                  remaining);
        if (sent == ESP_TLS_ERR_SSL_WANT_READ ||
            sent == ESP_TLS_ERR_SSL_WANT_WRITE) {
            return;
        }
    } else
#endif
    {
        ready = socket_poll_fd(entry->fd, true);
        if (ready < 0 && errno != EINTR) {
            socket_future_fail(state, errno, NULL);
            return;
        }
        if (ready <= 0) {
            return;
        }
        sent = send(entry->fd,
                    data,
                    remaining,
                    0);
        if (sent < 0 &&
            (errno == EAGAIN || errno == EWOULDBLOCK || errno == EINTR)) {
            return;
        }
    }
    if (sent <= 0) {
        entry->connected = false;
        entry->peer_closed = true;
        if (state->offset == 0) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
            if (entry->secure) {
                esp32_mquickjs_tls_error_capture(
                    &state->tls_error, entry->tls, ESP_FAIL);
            }
#endif
            socket_future_fail(state,
                               entry->secure ? EIO : errno,
                               entry->secure ? "TLS write failed" : NULL);
        } else {
            state->completed = true;
        }
        return;
    }
    state->offset += (size_t)sent;
    if (state->send_is_span_source) {
        state->send_span_offset += (size_t)sent;
    } else if (state->offset >= state->length) {
        state->completed = true;
    }
}

static void socket_future_step_receive(esp32_mquickjs_future_driver_state_t *state,
                                       socket_entry_t *entry,
                                       bool udp)
{
    int ready;

    if (!udp && !entry->connected) {
        state->empty_result = true;
        state->completed = true;
        return;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (!udp && entry->secure) {
        if (entry->tls == NULL) {
            socket_future_fail(state, EBADF, "TLS connection is unavailable");
            return;
        }
        state->received = esp_tls_conn_read(entry->tls,
                                            state->data,
                                            state->length);
        if (state->received == ESP_TLS_ERR_SSL_WANT_READ ||
            state->received == ESP_TLS_ERR_SSL_WANT_WRITE) {
            state->received = -1;
            return;
        }
    } else
#endif
    {
        ready = socket_poll_fd(entry->fd, false);
        if (ready < 0 && errno != EINTR) {
            socket_future_fail(state, errno, NULL);
            return;
        }
        if (ready <= 0) {
            return;
        }
    }
    if (udp) {
        state->address_len = sizeof(state->address);
        state->received = recvfrom(entry->fd,
                                   state->data,
                                   state->length,
                                   0,
                                   (struct sockaddr *)&state->address,
                                   &state->address_len);
    } else if (!entry->secure) {
        state->received = recv(entry->fd, state->data, state->length, 0);
    }
    if (state->received == 0 && !udp) {
        entry->connected = false;
        entry->peer_closed = true;
        state->empty_result = true;
        state->completed = true;
    } else if (!entry->secure && state->received < 0 &&
               (errno == EAGAIN || errno == EWOULDBLOCK || errno == EINTR)) {
        state->received = -1;
    } else if (state->received < 0) {
        if (!udp) {
            entry->connected = false;
        }
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
        if (entry->secure) {
            esp32_mquickjs_tls_error_capture(
                &state->tls_error, entry->tls, ESP_FAIL);
        }
#endif
        socket_future_fail(state,
                           entry->secure ? EIO : errno,
                           entry->secure ? "TLS read failed" : NULL);
    } else {
        state->completed = true;
    }
}

static void socket_future_step_udp_sendto(
    esp32_mquickjs_future_driver_state_t *state,
    socket_entry_t *entry)
{
    ssize_t sent;

    state->issued = true;
    if (!socket_future_resolve_address(state, SOCK_DGRAM)) {
        return;
    }
    sent = sendto(entry->fd,
                  state->data,
                  state->length,
                  0,
                  (struct sockaddr *)&state->address,
                  state->address_len);
    if (sent != (ssize_t)state->length) {
        socket_future_fail(state, errno, NULL);
        return;
    }
    state->offset = (size_t)sent;
    state->completed = true;
}

static void socket_future_step(esp32_mquickjs_future_driver_state_t *state)
{
    socket_entry_t *entry;

