99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
    if (state == NULL || state->completed || state->cancelled) {
        return;
    }
    entry = socket_future_entry(state);
    if (entry == NULL) {
        socket_future_fail(state, EBADF, "socket was closed during operation");
        return;
    }
    switch (state->kind) {
        case SOCKET_FUTURE_TCP_CONNECT:
            socket_future_step_connect(state, entry);
            break;
        case SOCKET_FUTURE_TCP_ACCEPT:
            socket_future_step_accept(state, entry);
            break;
        case SOCKET_FUTURE_TCP_SEND:
            socket_future_step_send(state, entry);
            break;
        case SOCKET_FUTURE_TCP_RECV:
            socket_future_step_receive(state, entry, false);
            break;
        case SOCKET_FUTURE_UDP_SENDTO:
            socket_future_step_udp_sendto(state, entry);
            break;
        case SOCKET_FUTURE_UDP_RECVFROM:
            socket_future_step_receive(state, entry, true);
            break;
    }
    if (!state->completed && state->deadline_us > 0 &&
        (uint64_t)esp_timer_get_time() >= state->deadline_us) {
        if (state->kind == SOCKET_FUTURE_TCP_CONNECT) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
            if (entry->secure) {
                esp32_mquickjs_tls_error_capture(
                    &state->tls_error, entry->tls, ESP_ERR_TIMEOUT);
            }
#endif
            socket_future_fail(state, ETIMEDOUT, "timed out");
        } else if (state->kind == SOCKET_FUTURE_TCP_SEND) {
            state->completed = true;
        } else {
            state->empty_result = true;
            state->completed = true;
        }
    }
}

static void socket_future_complete_nonblocking(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->timeout_ms != 0) {
        return;
    }
    if (state->kind == SOCKET_FUTURE_TCP_CONNECT) {
        socket_future_fail(state, ETIMEDOUT, NULL);
    } else if (state->kind == SOCKET_FUTURE_TCP_SEND) {
        state->completed = true;
    } else if (state->kind == SOCKET_FUTURE_TCP_ACCEPT ||
               state->kind == SOCKET_FUTURE_TCP_RECV ||
               state->kind == SOCKET_FUTURE_UDP_RECVFROM) {
        state->empty_result = true;
        state->completed = true;
    }
}

static bool socket_future_start(JSContext *ctx,
                                esp32_mquickjs_runtime_t *runtime,
                                esp32_mquickjs_future_token_t token,
                                esp32_mquickjs_future_driver_state_t *state)
{
    socket_entry_t *entry = socket_future_entry(state);
    esp_timer_create_args_t timer_args = {0};

    if (state == NULL || entry == NULL) {
        JS_ThrowReferenceError(ctx, "socket was closed before operation start");
        return false;
    }
    if (entry->busy) {
        JS_ThrowInternalError(ctx, "socket already has an operation in progress");
        return false;
    }
    entry->busy = true;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->timeout_ms > 0) {
        state->deadline_us = (uint64_t)esp_timer_get_time() +
                             (uint64_t)state->timeout_ms * 1000ULL;
    }
    socket_future_step(state);
    socket_future_complete_nonblocking(state);
    if (!state->completed) {
        timer_args.callback = socket_future_poll_timer;
        timer_args.arg = state;
        timer_args.dispatch_method = ESP_TIMER_TASK;
        timer_args.name = "mqjs_socket";
        timer_args.skip_unhandled_events = true;
        if (esp_timer_create(&timer_args, &state->poll_timer) != ESP_OK ||
            esp_timer_start_periodic(state->poll_timer,
                                     SOCKET_POLL_INTERVAL_US) != ESP_OK) {
            socket_future_stop_timer(state);
            JS_ThrowInternalError(ctx, "failed to start socket readiness poller");
            return false;
        }
    }
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t socket_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    socket_future_step(state);
    if (state != NULL && state->completed) {
        socket_future_stop_timer(state);
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    return ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue socket_future_make_udp_result(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    JSGCRef result_ref;
    JSGCRef data_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *data_view = JS_PushGCRef(ctx, &data_ref);

    if (!socket_format_address(&state->address,
                               state->host,
                               sizeof(state->host),
                               &state->remote_port)) {
        snprintf(state->host, sizeof(state->host), "unknown");
    }
    *result = JS_NewObject(ctx);
    *data_view = JS_IsException(*result)
        ? JS_EXCEPTION
        : esp32_mquickjs_new_owned_byte_view(ctx,
                                             state->data,
                                             (size_t)state->received);
    if (!JS_IsException(*data_view)) {
        state->data = NULL;
    }
    if (JS_IsException(*result) || JS_IsException(*data_view) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "data", *data_view) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "remoteHost",
                                         JS_NewString(ctx, state->host)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "remotePort",
                                         JS_NewInt32(ctx, state->remote_port))) {
        JS_PopGCRef(ctx, &data_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &data_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue socket_future_finish(JSContext *ctx,
                                    esp32_mquickjs_future_driver_state_t *state)
{
    socket_entry_t *entry = socket_future_entry(state);

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "socket operation cancelled");
    }
    if (state->error_code != 0) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
        if (state->tls_error.present) {
            const char *operation =
                state->kind == SOCKET_FUTURE_TCP_CONNECT
                    ? "socket.tcp.connect()"
                    : state->kind == SOCKET_FUTURE_TCP_SEND
                          ? "socket.tcp.send()"
                          : "socket.tcp.recv()";

            return esp32_mquickjs_throw_tls_error(
                ctx, operation, &state->tls_error);
        }
#endif
        return JS_ThrowInternalError(ctx,
                                     "%s%s%s: errno=%d",
                                     state->kind == SOCKET_FUTURE_TCP_CONNECT
                                         ? "socket.tcp.connect()"
                                         : state->kind == SOCKET_FUTURE_TCP_ACCEPT
                                             ? "socket.tcp.accept()"
                                             : state->kind == SOCKET_FUTURE_TCP_SEND
                                                 ? "socket.tcp.send()"
                                                 : state->kind == SOCKET_FUTURE_TCP_RECV
                                                     ? "socket.tcp.recv()"
                                                     : state->kind == SOCKET_FUTURE_UDP_SENDTO
                                                         ? "socket.udp.sendto()"
                                                         : "socket.udp.recvfrom()",
                                     state->error_text[0] != '\0' ? " " : " failed",
                                     state->error_text,
                                     state->error_code);
    }
    if (entry == NULL) {
        return JS_ThrowReferenceError(ctx, "socket was closed during operation");
    }
    switch (state->kind) {
        case SOCKET_FUTURE_TCP_CONNECT:
            entry->connected = true;
            entry->peer_closed = false;
            entry->remote_port = state->port;
            snprintf(entry->remote_host, sizeof(entry->remote_host), "%s", state->host);
            socket_refresh_local_address(entry);
            return JS_NewBool(true);
        case SOCKET_FUTURE_TCP_ACCEPT: {
            socket_entry_t *client;

            if (state->empty_result) {
                return JS_NULL;
            }
            client = socket_allocate_entry();
            if (client == NULL || !socket_set_nonblocking(state->client_fd)) {
                if (client != NULL) {
                    socket_reset_entry(client);
                }
                return JS_ThrowInternalError(ctx, "socket handle limit reached");
            }
            client->fd = state->client_fd;
            state->client_fd = -1;
            client->protocol = SOCKET_PROTOCOL_TCP;
            client->connected = true;
            socket_refresh_local_address(client);
            if (!socket_format_address(&state->address,
                                       client->remote_host,
                                       sizeof(client->remote_host),
                                       &client->remote_port)) {
                snprintf(client->remote_host, sizeof(client->remote_host), "unknown");
            }
            return JS_NewInt32(ctx, client->id);
        }
        case SOCKET_FUTURE_TCP_SEND:
            entry->sent_bytes += (uint32_t)state->offset;
            return JS_NewInt32(ctx, (int32_t)state->offset);
        case SOCKET_FUTURE_TCP_RECV:
            if (state->empty_result) {
                return JS_NULL;
            }
            entry->received_bytes += (uint32_t)state->received;
            {
                JSValue view = esp32_mquickjs_new_owned_byte_view(
                    ctx, state->data, (size_t)state->received);
                if (!JS_IsException(view)) {
                    state->data = NULL;
                }
                return view;
            }
        case SOCKET_FUTURE_UDP_SENDTO:
            entry->sent_bytes += (uint32_t)state->offset;
            return JS_NewInt32(ctx, (int32_t)state->offset);
        case SOCKET_FUTURE_UDP_RECVFROM:
            if (state->empty_result) {
                return JS_NULL;
            }
            entry->received_bytes += (uint32_t)state->received;
            return socket_future_make_udp_result(ctx, state);
    }
    return JS_ThrowInternalError(ctx, "invalid socket Future kind");
}

