99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/socket/esp32_mquickjs_socket.c
static bool socket_future_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->cancelled) {
        return false;
    }
    state->cancelled = true;
    state->completed = true;
    socket_future_stop_timer(state);
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return true;
}

static void socket_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    socket_entry_t *entry;

    if (state == NULL) {
        return;
    }
    socket_future_stop_timer(state);
    entry = socket_future_entry(state);
    if (entry != NULL) {
        entry->busy = false;
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
        if (state->kind == SOCKET_FUTURE_TCP_CONNECT &&
            entry->secure && !entry->connected) {
            socket_close_tls_connection(entry);
        }
#endif
    }
    if (state->client_fd >= 0) {
        close(state->client_fd);
    }
    socket_future_release_send_source(state);
    heap_caps_free(state->data);
    heap_caps_free(state);
}

static uint32_t socket_future_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return 0;
}

#define SOCKET_FUTURE_DRIVER(name, prepare_fn) \
    static const esp32_mquickjs_future_driver_t name = { \
        .prepare = prepare_fn, \
        .start = socket_future_start, \
        .poll = socket_future_poll, \
        .finish = socket_future_finish, \
        .cancel = socket_future_cancel, \
        .destroy = socket_future_destroy, \
        .timeout_ms = socket_future_timeout_ms, \
    }

SOCKET_FUTURE_DRIVER(s_socket_tcp_connect_driver, socket_tcp_connect_future_prepare);
SOCKET_FUTURE_DRIVER(s_socket_tcp_accept_driver, socket_tcp_accept_future_prepare);
SOCKET_FUTURE_DRIVER(s_socket_tcp_send_driver, socket_tcp_send_future_prepare);
SOCKET_FUTURE_DRIVER(s_socket_tcp_recv_driver, socket_tcp_recv_future_prepare);
SOCKET_FUTURE_DRIVER(s_socket_udp_sendto_driver, socket_udp_sendto_future_prepare);
SOCKET_FUTURE_DRIVER(s_socket_udp_recvfrom_driver, socket_udp_recvfrom_future_prepare);

#undef SOCKET_FUTURE_DRIVER

static bool socket_register_future_drivers(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref;
    JSGCRef socket_ref;
    JSGCRef tcp_ref;
    JSGCRef udp_ref;
    JSGCRef connect_ref;
    JSGCRef accept_ref;
    JSGCRef send_ref;
    JSGCRef recv_ref;
    JSGCRef sendto_ref;
    JSGCRef recvfrom_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *socket = JS_PushGCRef(ctx, &socket_ref);
    JSValue *tcp = JS_PushGCRef(ctx, &tcp_ref);
    JSValue *udp = JS_PushGCRef(ctx, &udp_ref);
    JSValue *connect_fn = JS_PushGCRef(ctx, &connect_ref);
    JSValue *accept_fn = JS_PushGCRef(ctx, &accept_ref);
    JSValue *send_fn = JS_PushGCRef(ctx, &send_ref);
    JSValue *recv_fn = JS_PushGCRef(ctx, &recv_ref);
    JSValue *sendto_fn = JS_PushGCRef(ctx, &sendto_ref);
    JSValue *recvfrom_fn = JS_PushGCRef(ctx, &recvfrom_ref);
    bool result;

    *global = JS_GetGlobalObject(ctx);
    *socket = JS_IsException(*global) ? JS_EXCEPTION
                                      : JS_GetPropertyStr(ctx, *global, "socket");
    *tcp = JS_IsException(*socket) ? JS_EXCEPTION
                                   : JS_GetPropertyStr(ctx, *socket, "tcp");
    *udp = JS_IsException(*socket) ? JS_EXCEPTION
                                   : JS_GetPropertyStr(ctx, *socket, "udp");
    *connect_fn = JS_IsException(*tcp) ? JS_EXCEPTION
                                       : JS_GetPropertyStr(ctx, *tcp, "connect");
    *accept_fn = JS_IsException(*tcp) ? JS_EXCEPTION
                                      : JS_GetPropertyStr(ctx, *tcp, "accept");
    *send_fn = JS_IsException(*tcp) ? JS_EXCEPTION
                                    : JS_GetPropertyStr(ctx, *tcp, "send");
    *recv_fn = JS_IsException(*tcp) ? JS_EXCEPTION
                                    : JS_GetPropertyStr(ctx, *tcp, "recv");
    *sendto_fn = JS_IsException(*udp) ? JS_EXCEPTION
                                      : JS_GetPropertyStr(ctx, *udp, "sendto");
    *recvfrom_fn = JS_IsException(*udp) ? JS_EXCEPTION
                                        : JS_GetPropertyStr(ctx, *udp, "recvfrom");
    result = !JS_IsException(*connect_fn) && !JS_IsException(*accept_fn) &&
             !JS_IsException(*send_fn) && !JS_IsException(*recv_fn) &&
             !JS_IsException(*sendto_fn) && !JS_IsException(*recvfrom_fn) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *connect_fn,
                                                    &s_socket_tcp_connect_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *accept_fn,
                                                    &s_socket_tcp_accept_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *send_fn,
                                                    &s_socket_tcp_send_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *recv_fn,
                                                    &s_socket_tcp_recv_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *sendto_fn,
                                                    &s_socket_udp_sendto_driver) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *recvfrom_fn,
                                                    &s_socket_udp_recvfrom_driver);
    if (!result) {
        JS_ThrowInternalError(ctx, "failed to register socket Future drivers");
    }
    JS_PopGCRef(ctx, &recvfrom_ref);
    JS_PopGCRef(ctx, &sendto_ref);
    JS_PopGCRef(ctx, &recv_ref);
    JS_PopGCRef(ctx, &send_ref);
    JS_PopGCRef(ctx, &accept_ref);
    JS_PopGCRef(ctx, &connect_ref);
    JS_PopGCRef(ctx, &udp_ref);
    JS_PopGCRef(ctx, &tcp_ref);
    JS_PopGCRef(ctx, &socket_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_socket_tcp_connect(JSContext *ctx,
                              JSValue *this_val,
                              int argc,
                              JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "tcp", "connect", argc, argv);
}

JSValue js_socket_tcp_listen(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    socket_entry_t *entry;
    int backlog;

    (void)this_val;
    if (argc < 1 ||
        (entry = socket_require_entry(ctx, argv[0], SOCKET_PROTOCOL_TCP)) == NULL) {
        return JS_EXCEPTION;
    }
    if (entry->connected || entry->busy) {
        return JS_ThrowInternalError(ctx, "TCP socket is already active");
    }
    if (entry->secure) {
        return JS_ThrowTypeError(ctx, "TLS socket handles are client-only and cannot listen");
    }
    if (!socket_optional_int(ctx,
                             argc,
                             argv,
                             1,
                             SOCKET_DEFAULT_LISTEN_BACKLOG,
                             1,
                             CONFIG_ESP32_MQUICKJS_SOCKET_MAX_HANDLES,
                             &backlog)) {
        return JS_ThrowRangeError(ctx, "invalid socket.tcp.listen() backlog");
    }
    if (listen(entry->fd, backlog) != 0) {
        return JS_ThrowInternalError(ctx, "socket.tcp.listen() failed: errno=%d", errno);
    }
    entry->listening = true;
    return JS_NewBool(true);
}

JSValue js_socket_tcp_accept(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "tcp", "accept", argc, argv);
}

JSValue js_socket_tcp_send(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "tcp", "send", argc, argv);
}

JSValue js_socket_tcp_recv(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "tcp", "recv", argc, argv);
}

JSValue js_socket_udp_sendto(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "udp", "sendto", argc, argv);
}

JSValue js_socket_udp_recvfrom(JSContext *ctx,
                               JSValue *this_val,
                               int argc,
                               JSValue *argv)
{
    (void)this_val;
    return socket_future_call_and_wait(ctx, "udp", "recvfrom", argc, argv);
}

#endif
